app/controllers/admin/dashboard_controller.rb

SELECT * FROM `feedback` WHERE (published = 1) AND ( (`feedback`.`type` = 'Comment' ) ) ORDER BY created_at DESC LIMIT 10
SELECT count(*) AS count_all FROM `feedback` WHERE (`feedback`.article_id = 7095 AND (`feedback`.`published` = 1)) AND ( (`feedback`.`type` = 'Comment' ) )
---
  def index
    @newposts = Article.count(:all, :conditions => ['published = ? and published_at > ?', true, current_user.last_venue])
    @newcomments = Feedback.count(:all, :conditions =>['state in (?,?) and published_at > ?', 'presumed_ham', 'ham', current_user.last_venue])