app/controllers/admin/resources_controller.rb

INSERT INTO `resources` (`size`, `updated_at`, `itunes_duration`, `itunes_summary`, `itunes_category`, `itunes_subtitle`, `itunes_keywords`, `itunes_explicit`, `itunes_author`, `filename`, `article_id`, `mime`, `created_at`, `itunes_metadata`) VALUES(NULL, '2008-10-25 22:16:25', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '1224151686262.jpg', NULL, 'image/jpeg', '2008-10-25 22:16:25', NULL)
SELECT `resources`.id FROM `resources` WHERE (`resources`.`filename` = BINARY '1224151686262.jpg') LIMIT 1
---
  def upload
    begin
      case request.method
        when :post
          file = params[:upload][:filename]
          unless file.content_type
            mime = 'text/plain'
          else
            mime = file.content_type.chomp
          end
          @up = Resource.create(:filename => file.original_filename, :mime => mime, :created_at => Time.now)

          @up.write_to_disk(file)
          @up.create_thumbnail

          @message = _('File uploaded: ')+ file.size.to_s

SELECT count(*) AS count_all FROM `resources`
UPDATE `resources` SET `updated_at` = '2008-10-25 22:16:25', `size` = 76697 WHERE `id` = 462
---
  def set_mime
    @resource = Resource.find(params[:resource][:id])
    @resource.mime = params[:resource][:mime] unless params[:resource][:mime].empty?
    if request.post? and @resource.save

SELECT * FROM `resources` ORDER BY created_at DESC LIMIT 0, 10
---
  def index
    @r = Resource.new
    @itunes_category_list = @r.get_itunes_categories
    @resources = Resource.paginate :page => params[:page], :conditions => "mime NOT LIKE '%image%'", :order => 'created_at DESC', :per_page => this_blog.admin_display_elements