app/controllers/admin/tags_controller.rb

SELECT count(*) AS count_all FROM `tags`
---
  def index
    if params[:order] and params[:order] =~ /\A(?:name|display_name|article_counter)\Z/
      if params[:sense] and params[:sense] == 'desc'
        order = params[:order] + " asc"
      else
        order = params[:order] + " desc"
      end
    else
      order = 'display_name ASC'
    end

    count = Tag.count

SELECT * FROM `tags` WHERE (`tags`.`id` = 749)
---
  def edit
    @tag = Tag.find(params[:id])