app/controllers/admin/textfilters_controller.rb

SELECT * FROM `text_filters` ORDER BY id DESC
---
  def index
    @textfilters = TextFilter.find(:all, :order => "id DESC")
    @textfilter_map = TextFilter.filters_map
    @macros = TextFilter.available_filters.select { |filter| TextFilterPlugin::Macro > filter }