app/controllers/articles_controller.rb

SELECT * FROM `contents` WHERE (`contents`.`published` = 1) AND ( (`contents`.`type` = 'Article' ) ) ORDER BY published_at DESC
---
  def index
    conditions = (Blog.default.statuses_in_timeline) ? ['type in (?, ?)', 'Article', 'Note'] : ['type = ?', 'Article']

    limit = this_blog.per_page(params[:format])
    unless params[:year].blank?
      @articles = Content.published_at(params.values_at(:year, :month, :day)).where(conditions).page(params[:page]).per(limit)